// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// const number = Number(prompt("Введіть число:"));
// console.log(number);

// if (number === 10) {
//   alert("Вірно");
// } else {
//   alert("Невірно");
// }
// alert(number === 10 ? "Вірно" : "Невірно");

// const value = confirm("Ви тут?");
// console.log(value);

// Task 2 ------------------------------------------------------

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// console.log(min);

// if (min < 15) {
//   alert(`${min} входить в першу чверть`);
// } else if (min < 30) {
//   alert(`${min} входить в другу чверть`);
// } else if (min < 45) {
//   alert(`${min} входить в третю чверть`);
// } else {
//   `${min} входить в третю чверть`;
// }

// Task 3 ------------------------------------------------------
// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const number = prompt("Виберіть число від 1 до 4");
// let result = "";

// switch (number) {
//   case "1":
//     result = "зима";

//     break;
//   case "2":
//     result = "весна";

//     break;
//   case "3":
//     result = "літо";

//     break;
//   case "4":
//     result = "ocінь";
//     break;
//   default:
//     result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
// }

// console.log(result);

// Task 4 ------------------------------------------------------
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

//! Завданння 5:
// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"


const login = prompt("Введіть ваш логін:");
if (login === "Адмін") {
  const password = prompt("Введіть ваш пароль:");
  else if (login === null || login === "") {
    alert("Скасовано");
  } else {
    alert("Я вас не знаю");
  }

  if (password === "Я головний") {
    alert("Добрий день!");
  } else {
    alert("Невірний пароль!");
  }
}